; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-14)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room6)
(at ball14 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 5 of 14
2. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 5 of 14
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 14
4. (drop ball1 roomb right)
   deleted: (carry ball1 right)
   added: (at ball1 roomb) (free right)
   goals met: 6 of 14
5. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 7 of 14
6. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 7 of 14
7. (pick ball14 room6 left)
   deleted: (at ball14 room6) (free left)
   added: (carry ball14 left)
   goals met: 7 of 14
8. (pick ball13 room6 right)
   deleted: (at ball13 room6) (free right)
   added: (carry ball13 right)
   goals met: 7 of 14
9. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 7 of 14
10. (drop ball13 roomb right)
   deleted: (carry ball13 right)
   added: (at ball13 roomb) (free right)
   goals met: 8 of 14
11. (drop ball14 roomb left)
   deleted: (carry ball14 left)
   added: (at ball14 roomb) (free left)
   goals met: 9 of 14
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 9 of 14
13. (pick ball9 room4 left)
   deleted: (at ball9 room4) (free left)
   added: (carry ball9 left)
   goals met: 9 of 14
14. (pick ball12 room4 right)
   deleted: (at ball12 room4) (free right)
   added: (carry ball12 right)
   goals met: 9 of 14
15. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 9 of 14
16. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 10 of 14
17. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 11 of 14
18. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 11 of 14
19. (pick ball11 room4 left)
   deleted: (at ball11 room4) (free left)
   added: (carry ball11 left)
   goals met: 11 of 14
20. (pick ball10 room4 right)
   deleted: (at ball10 room4) (free right)
   added: (carry ball10 right)
   goals met: 11 of 14
21. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 11 of 14
22. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 12 of 14
23. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 13 of 14
24. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 13 of 14
25. (pick ball8 room3 left)
   deleted: (at ball8 room3) (free left)
   added: (carry ball8 left)
   goals met: 13 of 14
26. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 13 of 14
27. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 14 of 14
